<?php
// Heading
$_['heading_title']       = 'Валюта плюс - ліцензія';

// Text
$_['text_extension']      = 'Розширення';
$_['text_all_users']      = 'Все користувачі';
$_['text_module']         = 'Модулі';
$_['text_license']        = 'Ліцензія';
$_['text_edit']           = 'Валюта плюс - ліцензія';
$_['text_notice']         = 'Для отримання ліцензійного ключа відправте на адресу <a href="mailto:louise@yandex.ru">louise@yandex.ru</a> лист з наступним змістом:
                            <ol>
                                <li>Адреса сайту, де ви купили модуль.</li>
                                <li>Ваш логін, який ви використовували при покупці.</li>
                                <li>Дату покупки.</li>
                                <li>Ваш домен, для якого ви хочете активувати модуль.</li>
                            </ol>

                            В теме письма укажите: Получение лицензии на модуль "Валюта плюс".<br/><br/>
                            <strong>Если Вы уже получали ключ для более ранних версий модуля, то получить новый ключ вы можете пройдя по следующей <a href="http://www.opencartplus.ru/getnewkey.php?module=currency_plus" target="_blank">ссылке</a>.</strong>';

// Entry
$_['entry_key']           = 'Введіть ліцензійний ключ:';


// Error
$_['error_permission']    = 'У Вас немає прав для зміни модуля Валюта плюс!';
$_['error_warning']       = 'Заповніть всі поля!';
?>